package conditions_2;

/**
 * 5.	Дана строка, в которой записано число. Преобразовать строку в число.
 */
public class HW2_5 {
    public static void main(String[] args) {
        String s = "27";
        int n = Integer.parseInt(s);
        System.out.println(n);
    }
}
