package conditions_2;

/**
 * 2.	Создать две строки, которые являются словами (просто по слову в каждой строке).
 * Соединить их вместе, разделив пробелом.
 */
public class HW2_2 {
    public static void main(String[] args) {
        String str1 = "Bon";
        String str2 = "Appetite";
        System.out.println(str1 + " " + str2 + "!");
    }
}
